功能：搭建一个简单的卷积神经网络，实现0到9数字的识别

tf.truncated_normal(shape,stddev)
//设置正态分布初值，制造随机噪音打破完全对称

tf.constant(0.1,shape)
//设置偏置，增加0.1以避免死亡节点

tf.nn.conv2d(x,W,strides=[1,1,1,1],padding='SAME')
//2维卷积函数
//参数中，x是输入
//W是卷积的参数，比如[5,5,1,32],前两个数字代表卷积核的尺寸，第三个数字代表channel数量，比如1，代表灰度单色，3代表彩色，最后一个数字代表卷积核的数量，即这个卷积层提取多少类特征
//strides代表卷积模板移动步长，都是1代表会不遗漏的划过图片每个点
//padding代表边界的处理方式，这里的SAME表示让输入输出保持同样尺寸

tf.nn.max_pool
//最大池化函数，这里的2x2最大池化表示将2x2的像素块降为1x1的像素
//最大池化会保留原始像素块中灰度值最高的一个像素，即保留最显著特征

x
//特征

y_
//真实的label

tf.reshape（x,[-1,28,28,1]）
//将1D的输入向量转化为2D的图片结构，即从原始的1x784形式转化为28x28的结构
//-1代表样本数量不固定
//1代表只有一个颜色通道



